Catalogs/НастройкиУчетаЗатрат.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>НастройкиУчетаЗатрат</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>БазаРаспределения</Name>
					<Type>
						<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ПланСчетов</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>СчетУчета</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ОсобыеПравилаРаспределения</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Подразделение</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СтатьяЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СтатьиЗатрат</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>БазаРаспределения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.БазыРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СписокСтатейЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.СписокСтатейЗатратВключенныхВБазуРаспределенияКосвенныхРасходов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетПрямыхЗатрат</Name>
							<Type>
								<v8:Type>cfg:ChartOfAccountsRef.Хозрасчетный</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПодразделениеЗатрат</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ПодразделенияОрганизаций</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

Catalogs/НастройкиУчетаЗатрат/Forms/ПравилаЗакрытияСчетовЗатрат/Ext/Form/Module.bsl
#Область ОписаниеПеременных

&НаКлиенте
Перем РезультатРедактированияСохранен;

#КонецОбласти

#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ЗаполнитьЗначенияСвойств(ЭтотОбъект, Параметры, "Период, Организация");
	
	Если ЭтоАдресВременногоХранилища(Параметры.РедактированиеНастроек) Тогда
		АдресРедактированиеНастроек = Параметры.РедактированиеНастроек;
	КонецЕсли;
	
	ЗаполнитьПравила();
	УстановитьЗаголовок();
	
	// Проверяется неинтерактивное право, так как прикладным пользователям ограничено интерактивное редактирование объекта
	ТолькоПросмотр = Не ПравоДоступа("Изменение", Метаданные.Справочники.НастройкиУчетаЗатрат);
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗакрытием(Отказ, ЗавершениеРаботы, ТекстПредупреждения, СтандартнаяОбработка)
	
	Если ЗавершениеРаботы Тогда
		Возврат;
	КонецЕсли;
	
	Если РезультатРедактированияСохранен = Истина Тогда
		Возврат;
	КонецЕсли;
	
	РезультатРедактирования = УстановитьПравила();
	
	РезультатРедактированияСохранен = Истина;
	
	Закрыть(РезультатРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ОбработкаОповещения(ИмяСобытия, Параметр, Источник)
	
	Если ИмяСобытия <> "ИзменениеКонтекстаНастроекУчетаЗатрат" Тогда
		Возврат;
	КонецЕсли;
	
	Если Источник <> АдресРедактированиеНастроек Тогда
		Возврат;
	КонецЕсли;
	
	ОбновитьКонтекст(Параметр);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовТаблицыФормыПравила

&НаКлиенте
Процедура ПравилаПередНачаломДобавления(Элемент, Отказ, Копирование, Родитель, Группа, Параметр)
	
	Отказ = Истина;
	
	ДанныеРедактирования = Неопределено;
	Если Копирование Тогда
		ДанныеРедактирования = Элементы.Правила.ТекущиеДанные;
	КонецЕсли;
	
	РедактироватьПравило(Неопределено, ДанныеРедактирования);
	
КонецПроцедуры

&НаКлиенте
Процедура ПравилаВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	
	РедактироватьПравило(ВыбраннаяСтрока, Элементы.Правила.ДанныеСтроки(ВыбраннаяСтрока));
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Процедура УстановитьЗаголовок()
	
	ЗаголовокФормы = НСтр("ru = 'Правила распределения затрат'");
	Шаблон               = НСтр("ru = '%1 (с %2)%3'");
	ЗаголовокОрганизация = "";
	Если ПолучитьФункциональнуюОпцию("ИспользоватьНесколькоОрганизаций") Тогда
		Шаблон               = НСтр("ru = '%1 (с %2, %3)'");
		ЗаголовокОрганизация = Строка(Организация);
	КонецЕсли;
	
	Заголовок = СтрШаблон(
		Шаблон,
		ЗаголовокФормы,
		ПериодМесяцРодительныйПадеж(Период),
		ЗаголовокОрганизация);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПериодМесяцРодительныйПадеж(Период)
	
	ПервыйСимволИмениМесяца = 4;
	ФорматнаяСтрока = НСтр("ru='ДФ=''dd.MMMM yyyy'''"); // При локализации сохранять позицию имени месяца
	
	Возврат Сред(Формат(Период, ФорматнаяСтрока), ПервыйСимволИмениМесяца);
	
КонецФункции

&НаСервере
Процедура ОбновитьКонтекст(Знач ИзмененноеСвойствоКонтекста)
	
	Если ТипЗнч(ИзмененноеСвойствоКонтекста) = Тип("СправочникСсылка.Организации") Тогда
		Организация = ИзмененноеСвойствоКонтекста;
	ИначеЕсли ТипЗнч(ИзмененноеСвойствоКонтекста) = Тип("Дата") Тогда
		Период = ИзмененноеСвойствоКонтекста;
	Иначе
		Возврат;
	КонецЕсли;
	
	УстановитьЗаголовок();
	
	ИсправлениеНастроек = Справочники.НастройкиУчетаЗатрат.НовыйБазовыеНастройкиУчетаЗатрат();
	Справочники.НастройкиУчетаЗатрат.ЗаполнитьПоУмолчанию(ИсправлениеНастроек);
	ЗаполнитьЗначенияСвойств(ИсправлениеНастроек.Контекст, ЭтотОбъект);
	
	УстановитьСодержимоеПравил(ИсправлениеНастроек);
	Справочники.НастройкиУчетаЗатрат.Исправить(ИсправлениеНастроек);
	ЗаполнитьСодержимоеПравил(ИсправлениеНастроек);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьПравила()
	
	Если Не ЭтоАдресВременногоХранилища(АдресРедактированиеНастроек) Тогда
		Возврат;
	КонецЕсли;
	
	РедактированиеНастроек = ПолучитьИзВременногоХранилища(АдресРедактированиеНастроек);// См. НовыйРедактированиеНастроекУчетаЗатрат()
	ЗаполнитьЗначенияСвойств(РедактированиеНастроек.Настройки.Контекст, ЭтотОбъект);
	Справочники.НастройкиУчетаЗатрат.Исправить(РедактированиеНастроек.Настройки);
	
	ЗаполнитьСодержимоеПравил(РедактированиеНастроек.Настройки);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьСодержимоеПравил(Источник)
	
	Настройки.БазаРаспределения = Источник.БазаРаспределения;
	
	Настройки.ОсобыеПравилаРаспределения.Очистить();
	
	Для Каждого СохраненноеПравило Из Источник.ОсобыеПравилаРаспределения Цикл
		
		Запись = Настройки.ОсобыеПравилаРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, СохраненноеПравило);
		УстановитьПредставлениеБазыРаспределения(Запись);
		
	КонецЦикла;
	
КонецПроцедуры

&НаСервере
Функция УстановитьПравила()
	
	Если Не Модифицированность Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	Если Не ЭтоАдресВременногоХранилища(АдресРедактированиеНастроек) Тогда
		Возврат Неопределено;
	КонецЕсли;
	
	РедактированиеНастроек = ПолучитьИзВременногоХранилища(АдресРедактированиеНастроек);
	
	РедактированиеНастроек.Модифицированность = Истина;
	
	УстановитьСодержимоеПравил(РедактированиеНастроек.Настройки);
	
	ПоместитьВоВременноеХранилище(РедактированиеНастроек, АдресРедактированиеНастроек);
	
	Возврат ЗначениеЗаполнено(РедактированиеНастроек.Настройки.ОсобыеПравилаРаспределения);
	
КонецФункции

&НаСервере
Процедура УстановитьСодержимоеПравил(Приемник)
	
	Приемник.ОсобыеПравилаРаспределения.Очистить();
	Для Каждого Правило Из Настройки.ОсобыеПравилаРаспределения Цикл
		
		Запись = Приемник.ОсобыеПравилаРаспределения.Добавить();
		ЗаполнитьЗначенияСвойств(Запись, Правило);
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура РедактироватьПравило(Идентификатор, ДанныеРедактирования)
	
	Если ДанныеРедактирования = Неопределено Тогда
		
		ПараметрыФормы = Новый Структура;
		
	Иначе
		
		ПараметрыФормы = НастройкиУчетаКлиент.ПоляПравилаРаспределения();
		ЗаполнитьЗначенияСвойств(ПараметрыФормы, ДанныеРедактирования);
		
	КонецЕсли;
	
	ПараметрыФормы.Вставить("Период",         Период);
	ПараметрыФормы.Вставить("Организация",    Организация);
	ПараметрыФормы.Вставить("ТолькоПросмотр", ТолькоПросмотр);
	
	ОповещениеОЗакрытии = Новый ОписаниеОповещения("ОкончаниеРедактированияПравила", ЭтотОбъект, Идентификатор);
	
	ОткрытьФорму(
		"Справочник.НастройкиУчетаЗатрат.Форма.ПравилоЗакрытияСчетовЗатрат",
		ПараметрыФормы,
		ЭтотОбъект,
		,
		,
		,
		ОповещениеОЗакрытии,
		РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
		
КонецПроцедуры

&НаКлиенте
Процедура ОкончаниеРедактированияПравила(РезультатЗакрытия, ИдентификаторПравила) Экспорт
	
	Если ТипЗнч(РезультатЗакрытия) <> Тип("Структура") Тогда
		Возврат;
	КонецЕсли;
	
	Если ИдентификаторПравила = Неопределено Тогда
		
		РедактируемаяСтрока = Настройки.ОсобыеПравилаРаспределения.Добавить();
		
	Иначе
		
		РедактируемаяСтрока = Настройки.ОсобыеПравилаРаспределения.НайтиПоИдентификатору(ИдентификаторПравила);
		Если РедактируемаяСтрока = Неопределено Тогда
			Возврат;
		КонецЕсли;
		
	КонецЕсли;
	
	ЗаполнитьЗначенияСвойств(РедактируемаяСтрока, РезультатЗакрытия);
	УстановитьПредставлениеБазыРаспределения(РедактируемаяСтрока);
	Модифицированность = Истина;

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Процедура УстановитьПредставлениеБазыРаспределения(РедактируемаяСтрока)
	
	РедактируемаяСтрока.ПредставлениеБазыРаспределения = ПредставлениеБазыРаспределения(
		РедактируемаяСтрока.БазаРаспределения,
		РедактируемаяСтрока.СписокСтатейЗатрат,
		РедактируемаяСтрока.СчетПрямыхЗатрат,
		РедактируемаяСтрока.ПодразделениеЗатрат);
	
КонецПроцедуры

&НаСервереБезКонтекста
Функция ПредставлениеБазыРаспределения(БазаРаспределения, СписокСтатейЗатрат, СчетПрямыхЗатрат, ПодразделениеЗатрат)
	
	ПредставлениеМодификаторов = "";
	Если БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.ОтдельныеСтатьиПрямыхЗатрат Тогда
		
		ПредставлениеМодификаторов = Строка(СписокСтатейЗатрат);
		
	ИначеЕсли БазаРаспределения = Перечисления.БазыРаспределенияКосвенныхРасходов.Выручка Тогда
		
		Модификаторы = Новый Массив;
		
		Если ЗначениеЗаполнено(СчетПрямыхЗатрат) Тогда
			Модификаторы.Добавить(СчетПрямыхЗатрат);
		КонецЕсли;
		
		Если ЗначениеЗаполнено(ПодразделениеЗатрат) Тогда
			Модификаторы.Добавить(ПодразделениеЗатрат);
		КонецЕсли;
		
		ПредставлениеМодификаторов = СтрСоединить(Модификаторы, НСтр("ru = '; '"));
		
	КонецЕсли;
	
	Если ПустаяСтрока(ПредставлениеМодификаторов) Тогда
		Возврат Строка(БазаРаспределения);
	Иначе
		Возврат СтрШаблон(НСтр("ru = '%1 (%2)'"), БазаРаспределения, ПредставлениеМодификаторов);
	КонецЕсли;
	
КонецФункции

#КонецОбласти
